[
    {
      "name" : "Carrot-and-Black Bean Crispy Tacos",
      "description" : "Dig into vegetarian tacos with tons of fresh flavor.",
      "source" : "http://www.countryliving.com/food-drinks/recipes/a39363/carrot-and-black-bean-crispy-tacos-recipe/",
      "steps" : [
        "Preheat oven to 450 degrees F. Heat 1 1/2 tablespoons oil in a medium saucepan over medium-high heat. Add onion and pepper and cook, stirring occasionally, until tender, 4to 6 minutes. Add chili powder and cook, stirring, until fragrant, 30 seconds. Add black beans and 1/3 cup water. Reduce heat to medium-low and cook, stirring occasionally, until thickened, 4 to 6 minutes. Mash beans with the back of the spoon until thick. Stir in lime juice. Season with salt and pepper.",
        "Meanwhile, toss carrots with cumin and 1 1/2 tablespoons oil on a rimmed baking sheet. Season with salt and pepper. Roast, turning once, until just tender, 10 to 12 minutes.",
        "Divide beans and carrots between taco shells. Top with avocado, queso fresco, cilantro, and radishes. Serve with lime wedges alongside."
      ],
      "ingredients" : [
        "Onion",
        "Black beans",
        "Carrots",
        "Taco shells"
      ],
      "picture" : "meal1"
    },
    {
      "name" : "Turkey Meatballs Over Zucchini Noodles",
      "description" : "Lighten up spaghetti night with lean turkey meat and fresh 'zoodles.'",
      "source" : "http://www.countryliving.com/food-drinks/recipes/a39371/turkey-meatballs-over-zucchini-noodles-recipe/",
      "steps" : [
        "Combine turkey, breadcrumbs, egg, parsley, Parmesan, 1 garlic clove, and 1/2 teaspoon each salt and pepper in a bowl. Form into 12 (1 1/2' to 2') meatballs.",
        "Heat 1 tablespoon oil in a large skillet over medium heat. Add meatballs and cook, turning occasionally, until brown on all sides, 4 to 6 minutes. Reduce heat to medium-low and gently stir in marinara. Simmer, turning meatballs occasionally, until meatballs are cooked through and sauce is thickened, 14 to 16 minutes.",
        "Meanwhile, heat remaining tablespoon oil in a medium skillet over medium-high heat. Add zucchini and remaining garlic and cook until just tender and heated through, 2 to 3 minutes. Season with salt and pepper.",
        "Heat broiler to high with rack in the top position. Sprinkle provolone over meatballs. Broil until cheese is golden brown, 3 to 4 minutes.",
        "Serve meatballs over noodles topped with Parmesan."
      ],
      "ingredients" : [
        "Turkey",
        "Breadcrumbs",
        "Egg",
        "Cheese",
        "Noodles"
      ],
      "picture" : "meal2"
    },
  {
    "name" : "Cherry-Prosciutto Grilled Pizzas",
    "description" : "These crispy flatbreads achieve the perfect combo of salty, tangy and sweet in every bite.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a38953/cherry-prosciutto-grilled-pizzas-recipe/",
    "steps" : [
      "Heat grill to medium-high set up for indirect grilling.",
      "With oiled hands, stretch dough into four (6'-x-8') ovals. Place on a baking sheet. Brush both sides of dough with 2 tablespoons oil, dividing evenly. Season with salt and pepper.",
      "Clean and oil grill grates. Place as many pieces of dough as will fit onto grates, over indirect heat. Grill, covered, until grill marks appear, 1 to 2 minutes.",
      "Turn dough and top with scallions, cheese, cherries, and prosciutto, dividing evenly. Grill, covered, until cheese melts and dough is cooked through, 3 to 5 minutes. Repeat with remaining dough and toppings, if necessary.",
      "Toss together arugula, basil, vinegar, and remaining 1 tablespoon oil. Season with salt and pepper.",
      "Top pizza with arugula mixture. Serve immediately."
    ],
    "ingredients" : [
      "Pizza dough",
      "Scallions",
      "Cheese"
    ],
    "picture" : "meal3"
  },
  {
    "name" : "Stuffed Chicken 4 Ways",
    "description" : "Give the weeknight staple an overhaul by stuffing it with one of these combos.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a39374/stuffed-chicken-4-ways-recipe/",
    "steps" : [
      "Starting at the top of the thickest portion, using a paring knife, cut a 2'-x-4' pocket into the chicken breasts.",
      "Stuff with the filling combination of your choice, dividing evenly.",
      "Season with salt and pepper.",
      "Heat 1 tablespoon olive oil in a large skillet over medium heat. Cook until an instant-read thermometer inserted in the thickest portion reaches 165 degrees F, 6 to 7 minutes per side."
    ],
    "ingredients" : [
      "Almonds",
      "Chicken"
    ],
    "picture": "meal4"
  },
  {
    "name" : "Chili-Garlic Grilled Chicken with Avocado-Cherry Salsa",
    "description" : "Grilled chicken gets a lift with this flavor-packed marinade and fresh, fruity salsa.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a38958/chili-garlic-grilled-chicken-with-avocado-cherry-salsa-recipe/",
    "steps" : [
      "Combine garlic, chili powder, 3 tablespoons oil, lime zest and 2 tablespoons juice, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper in a large zip-top bag. Add chicken, seal, and turn to coat. Marinate, in the refrigerator, 30 minutes and up to 2 hours.",
      "Meanwhile, combine cherries, shallot, jalapeño, cilantro, remaining 1 tablespoon oil, and remaining 2 tablespoons lime juice in a bowl. Season with salt and pepper. Let stand 15 minutes. Fold in avocado.",
      "Heat grill to medium-high. Remove chicken from marinade and pat dry with paper towels. Season with salt and pepper. Grill over direct heat, covered, until internal temperature reaches 165 degrees F, 6 to 8 minutes per side. Let stand 5 minutes.",
      "Serve with salsa and lime wedges."
    ],
    "ingredients" : [
      "Garlic",
      "Chicken",
      "Avocado"
    ],
    "picture" : "meal5"
  },
  {
    "name" : "Kimchi fried rice",
    "description" : "This simple, simple dish is super, super tasty. It’s just a few ingredients, but it’s a dish much loved by Koreans.",
    "source" : "http://www.maangchi.com/recipe/kimchi-bokkeumbap",
    "steps" : [
      "Heat up a pan. Add the vegetable oil.",
      "Add the kimchi and stir fry for 1 minute.",
      "Add rice, kimchi juice, water, and gochujang. Stir all the ingredients together for about 7 minutes with a wooden spoon.",
      "Add sesame oil and remove from the heat.",
      "Sprinkle with chopped green onion, roasted gim, and sesame seeds. Serve right away."
    ],
    "ingredients" : [
      "Rice",
      "Kimchi",
      "Sesame seeds"
    ],
    "picture" : "meal6"
  },
  {
    "name" : "Corn-and-Ham Risotto",
    "description" : "A bowl of creamy risotto is as comforting as dinner comes.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a39368/corn-and-ham-risotto-recipe/",
    "steps" : [
      "Heat oil in a large saucepan over medium heat. Add shallot and garlic and cook, stirring occasionally, until softened, 1 to 2 minutes. Add rice and cook, stirring, until opaque, 2 to 4 minutes. Add wine and cook, stirring occasionally, until liquid is absorbed, 1 to 2 minutes. Season with salt and pepper.",
      "Add 1 cup stock and cook, stirring until absorbed, 5 to 6 minutes. Repeat 2 more times. Add remaining cup stock and corn and cook, stirring, until rice is tender and corn is cooked through, 5 to 7 minutes. Stir in ham and cook until warmed through, 1 to 2 minutes. Remove from heat and stir in cheese until melted. Stir in chives. Season with salt and pepper.",
      "Serve immediately topped with additional chives."
    ],
    "ingredients" : [
      "Shallot",
      "Garlic",
      "Rice",
      "White wine",
      "Smoked ham",
      "Cheese"
    ],
    "picture" : "meal7"
  },
  {
    "name" : "Bass Packets with Tomato, Corn, Chickpeas, and Olives",
    "description" : "Get dinner on the table quick (and keep dirty dishes to a minimum) with these simple fish packets.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a38076/bass-packets-with-tomato-corn-chickpeas-and-olives-recipe/",
    "steps" : [
      "Preheat oven to 425 degrees F. Place corn, chickpeas, green beans, tomatoes, and olives on one side of four 11'-x-15' pieces of parchment paper, dividing evenly. Drizzle with oil, dividing evenly, and season with salt and pepper.",
      "Season fish with salt and pepper and top with oregano; place on vegetables, dividing evenly.",
      "Fold parchment over fish and vegetables, then fold edges under twice to seal. Transfer packets to baking sheet and bake until fish is opaque throughout, 12 to 15 minutes.",
      "Carefully tear open packets to serve."
    ],
    "ingredients" : [
      "Chickpeas",
      "Tomatoes",
      "Olives",
      "Bass",
      "Oregano"
    ],
    "picture" : "meal8"
  },
  {
    "name" : "Grilled Cumin-Rubbed Hanger Steak with Smashed Minty Peas and Grilled Bread",
    "description" : "Put a fresh spin on the classic steak dinner.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a37762/grilled-cumin-rubbed-hanger-steak-smashed-minty-peas-grilled-bread-recipe/",
    "steps" : [
      "Preheat grill to medium-high. Melt 2 tablespoons butter in a small saucepan over medium-high heat. Add peas and cook, stirring often, until soft, 6 to 8 minutes. Add remaining tablespoon butter and mash. Add mint and lime juice and stir to combine. Season with salt and pepper.",
      "Meanwhile, season steak with cumin and salt and pepper. Grill until internal temperature reaches 130 degrees F (medium-rare), 4 to 5 minutes per side. Let rest 5 minutes before slicing.",
      "Brush bread, on both sides, with oil. Grill until golden brown and crispy, about 1 minute per side.",
      "Serve pea mash topped with shaved Parmesan and steak and grilled bread alongside."
    ],
    "ingredients" : [
      "Frozen peas",
      "Hanger steak",
      "Country bread",
      "Parmesan"
    ],
    "picture" : "meal9"
  },
  {
    "name" : "Gingery Snap Pea Slaw with Seared Salmon",
    "description" : "This slaw packs a serious (flavor) punch.",
    "source" : "http://www.countryliving.com/food-drinks/recipes/a37755/gingery-snap-pea-slaw-with-seared-salmon-recipe/",
    "steps" : [
      "Combine snap peas, scallions, red jalapeño, fresh cilantro, fresh ginger, fresh lime juice, rice vinegar, canola oil, and soy sauce.",
      "Season with Kosher salt and freshly ground black pepper. Serve with seared salmon."
    ],
    "ingredients" : [
      "Snap peas",
      "Jalapeno",
      "Scallions",
      "Salmon"
    ],
    "picture" : "meal10"
  }
]